


DMM WG                                                          D. Patki
Internet-Draft                                             S. Gundavelli
Intended status: Standards Track                                   Cisco
Expires: October 15, 2016                                         J. Lee
                                                    Sangmyung University
                                                                   Q. Fu
                                                            China Mobile
                                                                L. Bertz
                                                                  Sprint
                                                          April 13, 2016


                 LMA Controlled MAG Session Parameters
            draft-ietf-dmm-lma-controlled-mag-params-01.txt

Abstract

   This specification defines a new extension, LMA-Controlled-MAG-
   Session-Params to Proxy Mobile IPv6.  This option can be used by the
   LMA in PMIPv6 signaling for notifying the MAG to conform to various
   parameters contained in this extension.

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on October 15, 2016.

Copyright Notice

   Copyright (c) 2016 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents



Patki, et al.           Expires October 15, 2016                [Page 1]

Internet-Draft    LMA Controlled MAG Session Parameters       April 2016


   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Conventions and Terminology  . . . . . . . . . . . . . . . . .  3
     2.1.  Conventions  . . . . . . . . . . . . . . . . . . . . . . .  3
     2.2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . .  3
   3.  Protocol Extension . . . . . . . . . . . . . . . . . . . . . .  3
     3.1.  Format of the LCMP Sub-Options . . . . . . . . . . . . . .  4
       3.1.1.  Binding Re-registration Control Sub-Option . . . . . .  5
       3.1.2.  Heartbeat Control Sub-Option . . . . . . . . . . . . .  6
   4.  Protocol Configuration Variables . . . . . . . . . . . . . . .  6
     4.1.  Local Mobility Anchor - Configuration Variables  . . . . .  7
   5.  Protocol Considerations  . . . . . . . . . . . . . . . . . . .  8
     5.1.  Local Mobility Anchor Considerations . . . . . . . . . . .  9
     5.2.  Mobile Access Gateway Considerations . . . . . . . . . . . 10
   6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 10
   7.  Security Considerations  . . . . . . . . . . . . . . . . . . . 11
   8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 11
     8.1.  Normative References . . . . . . . . . . . . . . . . . . . 11
     8.2.  Informative References . . . . . . . . . . . . . . . . . . 11
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 12























Patki, et al.           Expires October 15, 2016                [Page 2]

Internet-Draft    LMA Controlled MAG Session Parameters       April 2016


1.  Introduction

   A large PMIPv6 deployment, such as residential deployment, can have
   tens of thousands of MAGs spread across geographical locations.
   While it can be operationally challenging to manage such a large
   number of MAGs, it can also be very difficult to ensure configuration
   consistency across all the MAGs if they are not centrally managed.
   Configuring aggresive values of parameters such as re-registration
   timeout and heartbeat interval can potentially create considerable
   signaling load on the LMA.  This document provides a new option to
   enable the LMA to control various parameters on the MAG such as the
   re-registration frequency [RFC5213] and heartbeat frequency
   [RFC5847].  With this option, the configuration of these tunable
   parameters done centrally on the LMA enables Service Providers to
   have better control on the behavior of the MAGs with deterministic
   singaling load on the LMA.


2.  Conventions and Terminology

2.1.  Conventions

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

2.2.  Terminology

   All the terms used in this document are to be interpreted as defined
   in [RFC5213], [RFC5847] and [RFC7563].


3.  Protocol Extension

   The LMA Controlled MAG Parameters (LCMP) option is a mobility header
   option used to exchange information related to the parameters that a
   local mobility anchor enforces on a mobile access gateway.  The
   option can be included in Proxy Binding Acknowledgement (PBA) message
   only, and there MUST NOT be more than a single instance of this
   mobility option in a mobility message.  This mobility option MUST
   contain one or more LMA Controlled MAG Parameters sub-options.  The
   suboptions are defined in Section 3.1.  The alignment of this option
   MUST be 4n [RFC2460].








Patki, et al.           Expires October 15, 2016                [Page 3]

Internet-Draft    LMA Controlled MAG Session Parameters       April 2016


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Type     |   Length      |           Reserved            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                  ... LCMP Sub-option(s) ...                  ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



              Figure 1: LMA Controlled MAG Parameters Option

   Type

      MUST be set to the value of IANA-1, indicating that it is a LMA-
      Controlled-MAG-Parameters option.

   Length

      8-bit unsigned integer indicating the length in octets of the
      option, excluding the Type and Length fields.

   Reserved

      MUST be set to zero when sending and ignored when received.

   LCMP Sub-option(s)

      LCMP Sub-options are described in the below sections.  The sub-
      options are optional and can be present in any order.

3.1.  Format of the LCMP Sub-Options

   The LMA Controlled MAG Parameters sub-options are used for carrying
   information elements related to various parameters that need to be
   configured on the MAG.  These sub-options can be included in the LMA
   Controlled MAG Parameters option defined in Section 3.  The alignment
   of the sub-option MUST be 4n.  The format of this sub-option is as
   follows.



    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   LCMP Type   | LCMP Length   |       Sub-Option Data         ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




Patki, et al.           Expires October 15, 2016                [Page 4]

Internet-Draft    LMA Controlled MAG Session Parameters       April 2016


            Figure 2: LMA Controlled MAG Parameters Sub-Option

   Type

      8-bit unsigned integer indicating the type of the LMA Controlled
      MAG Parameters sub-option.  This specification defines the
      following types:

      0 - Reserved

      1 - Binding Refresh Control Sub-Option

      2 - Heartbeat Control Sub-Option

   Length

      8-bit unsigned integer indicating the number of octets needed to
      encode the Option Data, excluding the LCMP Type and LCMP Length
      fields of the sub-option.

3.1.1.  Binding Re-registration Control Sub-Option

   The Binding Re-registration Control Sub-Option is a mobility sub-
   option carried in the LMA Controlled MAG Parameters mobility option
   defined in Section 3.1.  This sub-option carries re-registration
   related timer values.  There MUST be no more than a single instance
   of this sub-option in LMA Controlled MAG Parameters option.  The
   format of this sub-option is defined below.


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | LCMP Type = 1 |  LCMP Length  |  Re-registration-Start-Time   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Initial-Retransmission-Time  | Maximum-Retransmission-Time   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


           Figure 3: Binding Re-registration Control Sub-Option

   Re-registration-Start-Time

      16-bit unsigned integer indicating the number of time units before
      the expiry of the PMIPv6 binding lifetime when the registration
      refresh process needs to be activated.  One time unit is 4
      seconds.




Patki, et al.           Expires October 15, 2016                [Page 5]

Internet-Draft    LMA Controlled MAG Session Parameters       April 2016


   Initial-Retransmission-Time

      16-bit unsigned integer indicating minimum delay in seconds before
      the first PBU retransmission of the exponential back-off process.

   Maximum-Retransmission-Time

      16-bit unsigned integer indicating maximum delay in seconds before
      the last PBU retransmission message of the exponential back-off
      process.

3.1.2.  Heartbeat Control Sub-Option



    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | LCMP Type = 2 |  LCMP Length  |        HB-Interval            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    HB-Retransmission-Delay    |    HB-Max-Retransmissions     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                  Figure 4: Heartbeat Control Sub-Option

   HB-Interval

      16-bit unsigned integer indicating heartbeat interval, i.e. time
      delay in seconds after a successful heartbeat exchange (request
      followed by response) when the next heartbeat exchange can be
      triggered.

   HB-Retransmission-Delay

      16-bit unsigned integer indicating minimum time delay in seconds
      before a heartbeat message is retransmitted.

   HB-Max-Retransmissions

      16-bit unsigned integer indicating maximum number of heartbeat
      retransmissions.


4.  Protocol Configuration Variables






Patki, et al.           Expires October 15, 2016                [Page 6]

Internet-Draft    LMA Controlled MAG Session Parameters       April 2016


4.1.  Local Mobility Anchor - Configuration Variables

   The local mobility anchor MUST allow the following variables to be
   configured by the system management.  The configured values for these
   protocol variables MUST survive server reboots and service restarts.

   EnableLCMPSubOptReregControl

      This flag indicates the operational state of the Binding Re-
      registration Control sub-option support.  The default value for
      this flag is set to (0), indicating that support for the Binding
      Re-registration Control sub-option is disabled.

      When this flag on the local mobility anchor is set to a value of
      (1), the local mobility anchor SHOULD include this sub-option in
      the Proxy Binding Acknowledge messages that it sends to the mobile
      access gateway; otherwise, it MUST NOT include the sub-option.
      There can be situations where the local mobility anchor is unable
      to obtain the Binding Re-registration Control information and may
      not be able to construct this sub-option.

   EnableLCMPSubOptHeartbeatControl

      This flag indicates the operational state of the Heartbeat Control
      sub-option support.  The default value for this flag is set to
      (0), indicating that support for the Heartbeat Control sub-option
      is disabled.

      When this flag on the local mobility anchor is set to a value of
      (1), the local mobility anchor SHOULD include this sub-option in
      the Proxy Binding Acknowledge messages that it sends to the mobile
      access gateway; otherwise, it MUST NOT include the sub-option.
      There can be situations where the local mobility anchor is unable
      to obtain the Heartbeat Control information and may not be able to
      construct this sub-option.

   The following variables MAY be defined at various granularity such as
   per binding, per peering MAG, per cluster of MAGs or any other custom
   grouping.  Regardless of the granularity of this configuration, the
   local mobility anchor should be able to determine the value of these
   variables on an individual binding basis by way of configuration
   hierarchy.

   LCMPReregistrationStartTime

      This variable is used to set the minimum time interval in number
      of seconds before the expiry of the PMIPv6 binding lifetime when
      the registration refresh process SHOULD be activated.



Patki, et al.           Expires October 15, 2016                [Page 7]

Internet-Draft    LMA Controlled MAG Session Parameters       April 2016


   LCMPInitialRetransmissionTime

      This variable is used to set the minimum delay in seconds before
      the first PBU retransmission of the exponential back-off process.
      This variable is same as INITIAL_BINDACK_TIMEOUT mentioned in
      Section 6.9.4 of [RFC5213].

   LCMPMaximumRetransmissionTime

      This variable is used to set the maximum delay in seconds before
      the last PBU retransmission message of the exponential back-off
      process.  This variable is same as MAX_BINDACK_TIMEOUT mentioned
      in Section 6.9.4 of [RFC5213].

   LCMPHeartbeatInterval

      This variable is used to set the time delay in seconds after a
      successful heartbeat exchange (request followed by response) when
      the next heartbeat exchange can be triggered.  The default value
      is 60 seconds.  It SHOULD NOT be set to less than 30 seconds or
      more than 3600 seconds.  The value of this variable MAY be derived
      from the variable HEARTBEAT_INTERVAL defined in Section 5 of
      [RFC5847] if defined on the local mobility anchor.

   LCMPHeartbeatRetransmissionDelay

      This variable is used to set the minimum time delay in seconds
      before a heartbeat message is retransmitted.  The value of this
      variable SHOULD be less than LCMP_HEARTBEAT_INTERVAL.  The default
      value is 5 seconds.

   LCMPHeartbeatMaxRetransmissions

      This variable is used to set the maximum number of heartbeat
      retransmissions.  The default value for this variable is 3.  The
      value of this variable MAY be derived from the variable
      MISSING_HEARTBEATS_ALLOWED defined in Section 5 of [RFC5847] if
      defined on the local mobility anchor.


5.  Protocol Considerations

   The following considerations apply to the local mobility anchor and
   the mobile access gateway.

   The conceptual Binding Cache Entry data structure maintained by the
   local mobility anchor, described in Section 5.1 of [RFC5213] and the
   conceptual Binding Update List entry data structure maintained by the



Patki, et al.           Expires October 15, 2016                [Page 8]

Internet-Draft    LMA Controlled MAG Session Parameters       April 2016


   mobile access gateway, described in Section 6.1 of [RFC5213], MUST be
   extended to store the LMA Controlled MAG Parameters option related
   information elements associated with the current session.
   Specifically the following parameters MUST be defined:

   o  LCMPReregistrationStartTime

   o  LCMPInitialRetransmissionTime

   o  LCMPMaximumRetransmissionTime

   o  LCMPHeartbeatInterval

   o  LCMPHeartbeatRetransmissionDelay

   o  LCMPHeartbeatMaxRetransmissions

5.1.  Local Mobility Anchor Considerations

   o  On receiving a Proxy Binding Update message [RFC5213] from a
      mobile access gateway, the local mobility anchor should check if
      EnableLCMPSubOptReregControl is set to (1).  If yes, and if all of
      LCMPReregistrationStartTime, LCMPInitialRetransmissionTime and
      LCMPMaximumRetransmissionTime are set to NON_ZERO values, then in
      SHOULD include Binding Re-registration Control Sub-Option in the
      LMA Controlled MAG Parameters mobility option which is in turn
      included in the Proxy Binding Acknowledge message.

   o  If EnableLCMPSubOptReregControl is set to (1) and if any of
      LCMPReregistrationStartTime, LCMPInitialRetransmissionTime and
      LCMPMaximumRetransmissionTime is set to ZERO value, then the local
      mobility anchor should report a configuration error.

   o  The local mobility anchor should also check if
      EnableLCMPSubOptHeartbeatControl is set to (1).  If yes, and if
      all of LCMPHeartbeatInterval, LCMPHeartbeatRetransmissionDelay and
      LCMPHeartbeatMaxRetransmissions are set to NON_ZERO values, then
      in SHOULD include Heartbeat Control Sub-Option in the LMA
      Controlled MAG Parameters mobility option which is in turn
      included in the Proxy Binding Acknowledge message.

   o  If EnableLCMPSubOptHeartbeatControl is set to (1) and if any of
      LCMPHeartbeatInterval, LCMPHeartbeatRetransmissionDelay and
      LCMPHeartbeatMaxRetransmissions is set to ZERO value, then the
      local mobility anchor should report a configuration error.






Patki, et al.           Expires October 15, 2016                [Page 9]

Internet-Draft    LMA Controlled MAG Session Parameters       April 2016


5.2.  Mobile Access Gateway Considerations

   o  On Receiving Proxy Binding Acknowledge message [RFC5213] from the
      local mobility anchor with LMA Controlled MAG Parameters mobility
      option, the mobile access gateway MUST overwrite the binding re-
      registration related timer parameters with the parameters received
      in Binding Re-registration Control Sub-Option, if present in the
      LMA Controlled MAG Parameters mobility option.  Similarly, the
      mobile access gateway MUST overwrite the heartbeat related timer
      parameters with the parameters reveived in Heartbeat Control Sub-
      Option, if present in the LMA Controlled MAG Parameters mobility
      option.

   o  If any of the parameters in the Binding Re-registration Control
      Sub-Option is ZERO, then the sub-option MUST be ignored and an
      error message SHOULD be logged.

   o  If any of the parameters in the Heartbeat Control Sub-Option
      except HB-Retransmission-Delay is ZERO, then the sub-option MUST
      be ignored and error message SHOULD be logged.


6.  IANA Considerations

   This document requires the following IANA actions.

   o  Action 1: This specification defines a new mobility header option,
      the LMA Controlled MAG Parameters.  This mobility option is
      described in Section 3.  The type value (IANA-1) for this option
      needs to be assigned from the same numbering space as allocated
      for the other mobility options, as defined in [RFC6275].

   o  Action 2: This specification defines a new mobility sub-option
      format, the LMA Controlled MAG Parameters sub-option.  The format
      of this mobility sub-option is described in Section 3.1.  This
      sub-option can be carried in the LMA Controlled MAG Parameters
      option.  The type value for this sub-option needs to be managed by
      IANA, under the registry "LMA Controlled MAG Parameters Sub-Option
      Type Values".  This specification reserves the following type
      values.  Approval of new LMA Controlled MAG Parameters sub-option
      type values are to be made through IANA Expert Review.

      +---+-----------------------------------------------------+
      | 0 | Reserved                                            |
      +---+-----------------------------------------------------+
      | 1 | Binding Re-registration Control Sub-Option          |
      +---+-----------------------------------------------------+
      | 2 | Heartbeat Control Sub-Option                        |



Patki, et al.           Expires October 15, 2016               [Page 10]

Internet-Draft    LMA Controlled MAG Session Parameters       April 2016


      +---+-----------------------------------------------------+


7.  Security Considerations

   The LMA Controlled MAG Parameters option defined in this
   specification is for use in Proxy Binding Acknowledgement message.
   This option is carried like any other mobility header option as
   specified in [RFC6275] and does not require any special security
   considerations.


8.  References

8.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, DOI 10.17487/
              RFC2119, March 1997,
              <http://www.rfc-editor.org/info/rfc2119>.

   [RFC5213]  Gundavelli, S., Ed., Leung, K., Devarapalli, V.,
              Chowdhury, K., and B. Patil, "Proxy Mobile IPv6",
              RFC 5213, DOI 10.17487/RFC5213, August 2008,
              <http://www.rfc-editor.org/info/rfc5213>.

   [RFC5847]  Devarapalli, V., Ed., Koodli, R., Ed., Lim, H., Kant, N.,
              Krishnan, S., and J. Laganier, "Heartbeat Mechanism for
              Proxy Mobile IPv6", RFC 5847, DOI 10.17487/RFC5847,
              June 2010, <http://www.rfc-editor.org/info/rfc5847>.

   [RFC7563]  Pazhyannur, R., Speicher, S., Gundavelli, S., Korhonen,
              J., and J. Kaippallimalil, "Extensions to the Proxy Mobile
              IPv6 (PMIPv6) Access Network Identifier Option", RFC 7563,
              DOI 10.17487/RFC7563, June 2015,
              <http://www.rfc-editor.org/info/rfc7563>.

8.2.  Informative References

   [RFC2460]  Deering, S. and R. Hinden, "Internet Protocol, Version 6
              (IPv6) Specification", RFC 2460, DOI 10.17487/RFC2460,
              December 1998, <http://www.rfc-editor.org/info/rfc2460>.

   [RFC6275]  Perkins, C., Ed., Johnson, D., and J. Arkko, "Mobility
              Support in IPv6", RFC 6275, DOI 10.17487/RFC6275,
              July 2011, <http://www.rfc-editor.org/info/rfc6275>.





Patki, et al.           Expires October 15, 2016               [Page 11]

Internet-Draft    LMA Controlled MAG Session Parameters       April 2016


Authors' Addresses

   Dhananjay Patki
   Cisco
   Cessna Business Park SEZ, Kadubeesanahalli
   Bangalore, Karnataka  560087
   India

   Email: dhpatki@cisco.com


   Sri Gundavelli
   Cisco
   170 West Tasman Drive
   San Jose, CA  95134
   USA

   Email: sgundave@cisco.com


   Jong-Hyouk Lee
   Sangmyung University
   31, Sangmyeongdae-gil, Dongnam-gu
   Cheonan 330-720
   Republic of Korea

   Email: jonghyouk@smu.ac.kr


   Qiao Fu
   China Mobile
   Xuanwumenxi Ave. No.32
   Beijing
   China

   Email: fuqiao1@outlook.com


   Lyle T Bertz
   Sprint
   Kansas
   USA

   Email: Lyle.T.Bertz@sprint.com







Patki, et al.           Expires October 15, 2016               [Page 12]

